Revit 2024 API
RoomTagFilter Constructor
 Constructs a filter which matches only rooms.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public RoomTagFilter()
Visual Basic
Public Sub New
Visual C++
public:
RoomTagFilter()
See Also
RoomTagFilter Class
Autodesk.Revit.DB.Architecture Namespace